# The script of the game goes in this file.

# Declare characters used by this game. The color argument colorizes the
# name of the character.

define FN = Character("ไฟร์เลน")
define WB = Character("ไวเซอร์")
define S = Character("พลทหาร")
define SO = Character("เจ้าหน้าที่ระดับสูง")
define bg_war = "bg_war.png"
# The game starts here.

label start:
    "อิสระภาพคืออะไร?"
    "การหลุดพ้น?"
    "การปลดปล่อย?"
    "หรือมันคือ..."
    "{color=#FF0000}การต่อสู้{/color}"

label Scn2:
    "ไม่ว่าจะในสถานการณืไหน \"มนุษย์\" ก็จะหาโอกาสเพื่อตนเอง"
    "ไม่ว่าโอกาสนั้นมันจะน้อยหรือมาก ก็จะทำมันเพื่อเอาชีวิตให้รอดในวันต่อๆไป"
    "เยี่ยงนักล่า ในจุดสูงสุดของห่วงโซ่อาหาร"
    " และนั้น ก็รวมไปถึง... การแย่งโอกาสของผู้อื่น"






label Sc8:
    show bg_war
    with fade
    "นี่ฉัน... อยู่ที่ไหน..."
    "??" "เธอบาดเจ็บตรงไหนบ้างมั้ย!? ได้ยินรึเปล่า!? "
label Q1Sc8: #คำถามที่1
    menu:
        "ฉันไม่เป็นไร":
            jump Q1Sc8_C1
        "ไม่ตอบกลับ":
            jump Q1Sc8_C2
label A1Sc8: #คำตอบของคำถามที่1
    label Q1Sc8_C1:
        "ฉ- ฉันไม่เป็นไร"

        "?" "โอเค! แต่เลือดไหลจะเต็มหัวเธออยู่แล้ว! เราต้องรีบออกไปจากตรงนี้เพื่อตามหาคนที่เป็นหมอ! แล้วเธอจำชื่อของเธอได้อยู่รึเปล่า!?"
        jump Q2Sc8
    label Q1Sc8_C2:
        "?" "ให้ตายสิ!"

        with hpunch
        "?" "มีสติหน่อย! เลือดไหลจะเต็มหัวเธอแล้วนะ! เราต้องรีบออกไปจากตรงนี้เพื่อตามหาคนที่เป็นหมอ! แล้วเธอจำชื่อของเธอได้อยู่รึเปล่า!?"
        jump Q2Sc8
label Q2Sc8: #คำถามที่2
    menu:
        "บอกชื่อ":
            jump A2Sc8_C1

        "...":
            jump A2Sc8_C2
label A2Sc8: #คำตอบของคำถามที่2
    
    label A2Sc8_C1:
        "จำได้สิ! ไฟร์เลน..."
        "ไฟร์เลน นัตช์!"
        jump Sc8_1
    
    label A2Sc8_C2:
        "?" "โธ่เว้ย!"
        "?" "ไฟร์เลน นัตช์!!!"
        "อ- อ่า! จำได้สิ!"
        jump Sc8_1
label Sc8_1:
    "แล้วฉันหละ"
    FN "ว- ไวเซอร์ บริเซอร์!"
    WB "เยี่ยม! เราต้องรีบไปข้างหน้าเพื่อทำลายเป้าหมาย! แต่ฉันต้องพาเธอไปหาหมอก่อน! ตามฉันมา!"
    #เสียงวิ่งบนดินที่แห้ง, เสียงระเบิดรอบๆต่อเนื่อง, เสียงของกระสุนที่พุ่งลอยผ่าน เดี๋ยวเพิ่มขอเรียนรู้ก่อน
    "'ทั้งสองได้วิ่งไปข้างหน้าอย่างทุลักทุเล ก่อนที่จะไปหยุดอยู่กับกลุ่มทหารที่อยู่ในหลุมกำบังที่เกิดขึ้นมาโดยกระสุนปืนใหญ่'"
    WB "เฮ่! พวกนาย! มีใครในนี้เป็นหมอบ้าง!?"
    S "ไม่มีเลยครับ! หมอของพวกเราพึ่งถูกปืนกลจากฝั่งนั้นฆ่าไปไม่กี่นาทีก่อนหน้านี้ครับ!"
    WB "ชิ. ไฟร์เลน, ดูเหมือนจะไม่มีทางอื่นแล้ว เธออยู่นี่ก่อนล่ะไฟร์เลน ฉันจะรีบกลับมา, พร้อมกับอุปกรณ์รักษาที่ดีกว่าผ้านี่แน่นอน!"
    "'ไวเซอร์ ใช้ผ้าผันแผลที่ไม่ค่อยสะอาดเท่าไหร่ปิดแผลชั่วคราวให้กับ ไฟร์เลน'"
    WB "จำนวนพลโดยรอบนี้มีอยู่เท่าไหร่!"
    S "ประมาณ 18-20 นายครับ!"
    WB "ดีล่ะ! รวมพลทุกคนตรงนี้! เราจะมาวางแผนและจัดการพวกนั้นภายในทีเดียวไปเลย!"
    "'ไวเซอร์ ได้วางแผนพร้อมกับทหารทุกนายที่อยู่โดยรอบ'"
    WB "..."
    WB "เอาล่ะ!"
    WB "สาม..."
    WB "สอง.."
    WB "หนึ่ง"
    WB "ลุยยยยย!!!"
    "พลทหารหลายนาย" "ไปปปปป!!!"
    FN "..."
    FN "ฉัน..."
    FN "อา.."
    "'ไฟร์เลน ได้สลบไป'"
    "..."
    "เวลาต่อไป"

label Sc9:
    WB "ภารกิจ... สำเร็จแล้ว... ไฟร์เลน! พวกเราทำได้แล้ว! เราจะได้ไปอยู่ในชั้นต่อไปแล้ว!"

label Sc10:
    hide bg_war 
    SO "ทำได้ดีมากไวเซอร์ การกำจัดฝั่งตรงข้ามแบบนั้นถือว่าเป็นอะไรที่บ้าบิ่นและกล้าหาญมาก บวกกับแผนการที่ฉลาดสุดๆ"
    SO "จากการสังเกตการของเบื้องบน ทุกคนได้ตัดสินใจให้นายได้เลื่อนขึ้นไปอยู่ชั้นบนอีกระดับ พร้อมกับยศ 8/1F และการส่งเสริมด้านความรู้แบบเต็มรูปแบบ"
    WB "ขอบคุณครับ"
    WB "ส่วนเธอคนนี้.."
    SO "..."
    SO "เธอ, ไฟร์เลน นัตช์ ใช่มั้ย"
    FN "ใช่ค่ะ"
    SO "จากการสังเกตการ, เธอไม่ได้สร้างผลอะไรในครั้งนี้ คะแนนของเธอจึงต่ำอยู่ระดับหนึ่ง จึงยังไม่มีการเลื่อนขั้นอะไรทั้งนั้น"
    WB "แต่ว่า, อย่างน้อยๆก็ให้เธอได้เลื่อนขั้นซักหน่อยไม่ดีหรอครับ?"
    SO "ไม่มีแต่, ยศของเธอจะยังอยู่ที่ 9/3P"
    WB "..."
    WB "รับทราบครับ..."
    SO "ดี, งั้น มากับฉัน, พร้อมกับคนอื่นๆที่ร่วมกับนายเมื่อกี้ด้วย ส่วนเธอคนนั้นจะให้พวกนี้จัดการรักษาเธอ"

label Sc11:
    "พยาบาลคนที่ 1" "มากับเราทางนี้เดี๋ยวพวกฉันจะรักษาให้"
    "พยาบาลคนที่ 2" "ไม่เป็นไรนะ"


return
