# The script of the game goes in this file.

# Declare characters used by this game. The color argument colorizes the
# name of the character.

define FN = Character("ไฟร์เลน")
define WB = Character("ไวเซอร์")
define S = Character("พลทหาร")
define SO = Character("เจ้าหน้าที่ระดับสูง")
define GLE = Character("ยายเลค์ลิน")
define GRV = Character("ตาไรล์วิน")
define bg_war = "bg_war.png"
# The game starts here.

label start:
    "อิสระภาพคืออะไร?"
    "การหลุดพ้น?"
    "การปลดปล่อย?"
    "หรือมันคือ..."
    "{color=#FF0000}การต่อสู้{/color}"
label Scn2:
    "ไม่ว่าจะในสถานการณืไหน \"มนุษย์\" ก็จะหาโอกาสเพื่อตนเอง"
    "ไม่ว่าโอกาสนั้นมันจะน้อยหรือมาก ก็จะทำมันเพื่อเอาชีวิตให้รอดในวันต่อๆไป"
    "เยี่ยงนักล่า ในจุดสูงสุดของห่วงโซ่อาหาร"
    " และนั้น ก็รวมไปถึง... การแย่งโอกาสของผู้อื่น"






label Sc8:
    show bg war
    with fade
    play music "war_sound1.mp3" fadein 1.0 volume 1.0
    "นี่ฉัน... อยู่ที่ไหน..."
    "??" "เธอบาดเจ็บตรงไหนบ้างมั้ย!? ได้ยินรึเปล่า!? "
label Q1Sc8: #คำถามที่1
    menu:
        "ฉันไม่เป็นไร":
            jump Q1Sc8_C1
        "ไม่ตอบกลับ":
            jump Q1Sc8_C2
label A1Sc8: #คำตอบของคำถามที่1
    label Q1Sc8_C1:
        "ฉ- ฉันไม่เป็นไร"

        "?" "โอเค! แต่เลือดไหลจะเต็มหัวเธออยู่แล้ว! เราต้องรีบออกไปจากตรงนี้เพื่อตามหาคนที่เป็นหมอ! แล้วเธอจำชื่อของเธอได้อยู่รึเปล่า!?"
        jump Q2Sc8
    label Q1Sc8_C2:
        "?" "ให้ตายสิ!"
        play sound "audio/slap_sound.mp3"
        with hpunch
        "?" "มีสติหน่อย! เลือดไหลจะเต็มหัวเธอแล้วนะ! เราต้องรีบออกไปจากตรงนี้เพื่อตามหาคนที่เป็นหมอ! แล้วเธอจำชื่อของเธอได้อยู่รึเปล่า!?"
        jump Q2Sc8
label Q2Sc8: #คำถามที่2
    menu:
        "บอกชื่อ":
            jump A2Sc8_C1

        "...":
            jump A2Sc8_C2
label A2Sc8: #คำตอบของคำถามที่2
    
    label A2Sc8_C1:
        "จำได้สิ! ไฟร์เลน..."
        "ไฟร์เลน นัตช์!"
        jump Sc8_1
    
    label A2Sc8_C2:
        "?" "โธ่เว้ย!"
        "?" "ไฟร์เลน นัตช์!!!"
        "อ- อ่า! จำได้สิ!"
        jump Sc8_1
label Sc8_1:
    "แล้วฉันหละ"
    FN "ว- ไวเซอร์ บริเซอร์!"
    WB "เยี่ยม! เราต้องรีบไปข้างหน้าเพื่อทำลายเป้าหมาย! แต่ฉันต้องพาเธอไปหาหมอก่อน! ตามฉันมา!"
    #เสียงวิ่งบนดินที่แห้ง, เสียงระเบิดรอบๆต่อเนื่อง, เสียงของกระสุนที่พุ่งลอยผ่าน เดี๋ยวเพิ่มขอเรียนรู้ก่อน
    "'ทั้งสองได้วิ่งไปข้างหน้าอย่างทุลักทุเล ก่อนที่จะไปหยุดอยู่กับกลุ่มทหารที่อยู่ในหลุมกำบังที่เกิดขึ้นมาโดยกระสุนปืนใหญ่'"
    WB "เฮ่! พวกนาย! มีใครในนี้เป็นหมอบ้าง!?"
    S "ไม่มีเลยครับ! หมอของพวกเราพึ่งถูกปืนกลจากฝั่งนั้นฆ่าไปไม่กี่นาทีก่อนหน้านี้ครับ!"
    WB "ชิ. ไฟร์เลน, ดูเหมือนจะไม่มีทางอื่นแล้ว เธออยู่นี่ก่อนล่ะไฟร์เลน ฉันจะรีบกลับมา, พร้อมกับอุปกรณ์รักษาที่ดีกว่าผ้านี่แน่นอน!"
    "'ไวเซอร์ ใช้ผ้าผันแผลที่ไม่ค่อยสะอาดเท่าไหร่ปิดแผลชั่วคราวให้กับ ไฟร์เลน'"
    WB "จำนวนพลโดยรอบนี้มีอยู่เท่าไหร่!"
    S "ประมาณ 18-20 นายครับ!"
    WB "ดีล่ะ! รวมพลทุกคนตรงนี้! เราจะมาวางแผนและจัดการพวกนั้นภายในทีเดียวไปเลย!"
    "'ไวเซอร์ ได้วางแผนพร้อมกับทหารทุกนายที่อยู่โดยรอบ'"
    WB "..."
    WB "เอาล่ะ!"
    WB "สาม..."
    WB "สอง.."
    WB "หนึ่ง"
    WB "ลุยยยยย!!!"
    S "ไปปปปป!!!"
    FN "..."
    FN "ฉัน..."
    FN "อา.."
    hide bg war
    with fade
    "'ไฟร์เลน ได้สลบไป'"
    "..."
    stop music
    "เวลาต่อมา ณ สนามเพาะของศัตรูที่ถูกยึด"
label Sc9:
    show bg scn9
    with fade
    WB "ภารกิจ... สำเร็จแล้ว... ไฟร์เลน! พวกเราทำได้แล้ว! เราจะได้ไปอยู่ในชั้นต่อไปแล้ว!"
label Sc10:
    show bg scn10
    with fade
    play music "chill_sound1.mp3" fadein 1.0 volume 1.0
    SO "ทำได้ดีมากไวเซอร์ การกำจัดฝั่งตรงข้ามแบบนั้นถือว่าเป็นอะไรที่บ้าบิ่นและกล้าหาญมาก บวกกับแผนการที่ฉลาดสุดๆ"
    SO "จากการสังเกตการของเบื้องบน ทุกคนได้ตัดสินใจให้นายได้เลื่อนขึ้นไปอยู่ชั้นบนอีกระดับ พร้อมกับยศ 8/1F และการส่งเสริมด้านความรู้แบบเต็มรูปแบบ"
    WB "ขอบคุณครับ"
    WB "ส่วนเธอคนนี้.."
    SO "..."
    SO "เธอ, ไฟร์เลน นัตช์ ใช่มั้ย"
    FN "ใช่ค่ะ"
    SO "จากการสังเกตการ, เธอไม่ได้สร้างผลอะไรในครั้งนี้ คะแนนของเธอจึงต่ำอยู่ระดับหนึ่ง จึงยังไม่มีการเลื่อนขั้นอะไรทั้งนั้น"
    WB "แต่ว่า, อย่างน้อยๆก็ให้เธอได้เลื่อนขั้นซักหน่อยไม่ดีหรอครับ?"
    SO "ไม่มีแต่, ยศของเธอจะยังอยู่ที่ 9/3P"
    WB "..."
    WB "รับทราบครับ..."
    SO "ดี, งั้น มากับฉัน, พร้อมกับคนอื่นๆที่ร่วมกับนายเมื่อกี้ด้วย ส่วนเธอคนนั้นจะให้พวกนี้จัดการรักษาเธอ"
label Sc11:
    show bg scn11
    with fade
    "พยาบาลคนที่ 1" "มากับเราทางนี้เดี๋ยวพวกฉันจะรักษาให้"
    "พยาบาลคนที่ 2" "ไม่เป็นไรนะ"
    FN "..."
    WB "..."
    stop music
label Sc12:
    show bg scn12
    with fade
    play music "chill_sound2.mp3" fadein 1.0 volume 1.0
    "เวลาต่อมา ณ หมู่บ้านแห่งหนึ่ง, หน้าประตูของบ้านหลังหนึ่ง"
    "?" "รอแป๊บนึงนะ"
    FN "กลับมาแล้วค่ะ คุณยายเลค์ลิน"
    GLE "โฮ้! ไฟร์เลน! หลานบาดเจ็บตรงไหนมากรึเปล่า!? ในการแข่งนั้นสร้างปัญหาอะไรให้หลานรึเปล่า!?"
    FN "หนูไม่เป็นอะไรแล้วค่ะ พยาบาลจากชั้นบนเขารักษาหนูให้หายดีแล้วค่ะ"
    GLE "ยายดีใจมากนะที่หลานรอดกลับมา! ตาต้องดีใจมากแน่ๆ"
    FN "แล้วคุณตาอยู่ไหนหรอคะ?"
    GLE "ยังทำงานอยู่ที่นารวมจ๊ะ เดียวอีกสักพักน่าจะกลับมาแล้ว"
    "?" "โอยยย! เลค์ลิน!"
    GLE "นั้นไงกลับมาแล้ว ไรล์วิน! ดูซิ้ใครกลับมา!"
    "?" "ห้ะ!!!"
    FN "ว้าาา-"
    "?" " ไฟร์เลน! ไฟร์เลน! ปลอดภัยดีใช่มั้ย!"
    FN "ค- ค่ะ. คุณตาไรล์วิน"
    GRV "หลานเก่งมากๆเลยนะ! ที่เอาตัวรอดกลับมาได้น่ะ!"
    GLE "แล้วเพื่อนของหลานที่ชอบมาส่งหลานบ่อยๆอยู่ไหนล่ะ"
    GLE "คนที่ชื่อ... ไวเซอร์ น่ะ คนที่ทำให้หลานกลับมาได้เสมอๆ"
    GRV "ตากับยายช่วยกันทำขนมปังสูตรเด่นที่เขาชอบเอาไว้ จะให้เป็นการตอบแทนเขาน่ะ"
    FN "..."
    FN "เขา... ได้ถูกเลื่อนขั้นขึ้นไปอยู่อีกระดับชั้นแล้วค่ะ... คงไม่ลงมาที่ชั้น 9 นี้แล้ว..."
    GRV "จริงหรอเนี่ย... แล้วแบบนี้ถ้ามีการแข่งครั้งต่อไปแล้วหลานจะมีใครช่วยมั้ยเนี่ย..."
    FN "ตอนนี้อย่าไปสนใจเรื่องการแข่งนั้นเลยจะดีกว่าค่ะ หนูคิดว่าเข้าไปในบ้านกันก่อนจะดีมั้ยคะ?"
    GRV "ตาคิดว่าแบบนั้นก็ดีเหมือนกัน เราเข้าไปในบ้านกันก่อนดีกว่า"
    "ไม่กี่นาทีต่อมาในบ้าน"
    FN "ช่วงนี้... บ้านเราพุพังใกล้จะเต็มทีเลยนะคะ"
    GLE "ใช่แล้วจ๊ะ, ยิ่งผ่านไปนาน บ้านหลังนี้ก็ใกล้จะพังลงไปทุกทีๆ"
    GRV "ถ้าเป็นสมัยก่อน บ้านหลังนี้ถือว่าใหญ่และสะอาดมากเลยล่ะ"
    GRV "ทุกที่รอบๆนี้ก็เคยเป็นแบบนั้นเหมือนกัน"
    GRV "แต่ก็เพราะเหตุการณ์ {color=#FFFF00}<สลายทุ่งเหลือง>{/color} นั้นที่ทำให้ {color=#C3BBB3}<ข้าว>{/color} ที่พวกเราขายดิบขายดีใน ชั้นที่ 9 ที่เคยรุ่งเรืองพังลง"
label Q1Sc12:
    menu:
        "อ่า... เริ่มเล่าเรื่องนี้อีกแล้ว...":
            jump A1Sc12_C1
            
        "เกิดขึ้นอะไรต่อหรอคะ":
            jump A1Sc12_C2
label A1Sc12:
    
    label A1Sc12_C1:
        GLE "ฟังๆ ไปเถอะจ๊ะ"
        jump Scn13

    label A1Sc12_C2:
        FN "เกิดขึ้นอะไรต่อหรอคะ"
        jump Scn13
label Scn13:
    show bg scn13
    with fade
    play music "not_so_chill_sound1.mp3" fadein 1.0 volume 1.0
    GRV "ในช่วงแรกๆ พวกที่อยู่ชั้นบน, บนนอกอวกาศนั้น แทบจะไม่มีอาหารกิน"
    GRV "มีเพียงบนโลกที่ผลิต {color=#C3BBB3}<ข้าว>{/color} ได้"
    GRV "หลานเคยได้ยินรึเปล่าว่า \"การอยู่ในทะเลนานๆ ทำให้ผู้ชายเห็นผู้ชายด้วยกันเองสวยขึ้นได้\" "
label Scn14:
    show bg scn14
    with fade
    GRV "ข้าวก็เป็นแบบนั้นเช่นกัน เหล่าชนชั้นสูงที่ไม่มีอะไรจะกิน ก็ได้ลิ่มลองข้าวที่มาจากโลกในจำนวนอันน้อยนิด"
    GRV "และในตอนนั้น... พวกเขาก็ได้รู้ว่ามันอร่อยขนาดไหน"
label Scn15:
    show bg scn15
    with fade
    GRV "หลังจากนั้นก็ได้มีบริษัทหนึ่งถูกก่อตั้งขึ้นมาบนโลกที่มีชื่อว่า <Riccing Corporation> จากคนชนชั้นสูง"
    GRV 'ที่ได้ลงมาเป็นนายทุน คอยควบคุมและซื้อขายกระจายข้าว ทำให้ชั้น 9 นี้นั้นรุ่งเรือง มีแต่ทุ่งนาอยู่ทุกที่'
    GRV "และนักลงทุนจากชั้นอื่นๆก็ได้เข้ามาทำสัญญาด้วย"
    GRV "พวกเขาต้องการข้าว มาก และ มากขึ้น สิ่งนั้นทำให้โลกนี้มีทุ่งนาอยู่ถึง \70-98\%"
    GRV "เมื่อพวกเขานำข้าวไป เราก็ได้เงิน และพวกเขาก็นำไปขายให้กับนายทุนคนอื่นๆ"
    GRV "ราคาที่พวกนั้นตั้ง ก็มากขึ้นและมากขึ้น หรือการเก็งราคา เพราะการแข่งขันกันจากการที่มีคู่แข่งและทำสัญญาจำนวนมาก ทั้งการขยายเป็นวงจรเหมือนการขยายตัวของ{color=#e7feff}ฟองสบู่{/color}"
    GRV "ถึงแม้จะหารายได้มาได้มาก แต่สภาพอากาศบนโลกก็แย่ลง ทำให้ดินเสียจากการเก็บเกี่ยว"
    GRV "ทำให้ต้องมีการใช้ <ข้าวเทียม> ที่คุณภาพอยู่ในขั้นไม่ปลอดภัย และเมื่อมีหนึ่งในนักลงทุนได้รู้เข้า"
    GRV "สื่อก็ได้ตามมา ส่วนนักลงทุนคนอื่นๆที่เก็งราคา ก็ได้แตกและขายข้าวออกจนหมด เพราะความคาดหวังและความวางใจได้หายไป"
    GRV "และหนึ่งในชั้นบนพวกนั้นก็ได้คิดค้นอาหารแปรรูปที่ดีกว่า และข้าวก็ได้ราคาตกลง"
    GRV "และรัฐบาลที่เลือดเย็นพวกนั้นก็ได้เข้ามาจักการกับปัญหาตรงนี้ต่อ..."
    stop music
    GRV "..."
    GRV "ไฟร์เลน, นี่หลานหลับไปหรอ"
    play music "chill_sound3.mp3" fadein 1.0 volume 1.0
    FN "อ- อะ! ค่ะ! แล้วหลังจากนั้นก็ได้มีนารวมเกิดขึ้น เพื่อทุกคนในนี้จะได้มีกินต่อ และถือว่าเป็นบุญคุณจากรัฐบาล ที่มีต่อทุกคนค่ะ!"
    FN "และก็ยังมีโปรแกรมการแข่ง Colosseum Stair Path หรือ C.S.P. ที่มีในชั้นอื่นๆ ลงมาในชั้นนี้เพื่อให้พวกเราได้ยกระดับตัวเองขึ้นไปอยู่ชั้นต่อๆไป จนถึงระดับสูงสุด ที่เหมือนกับผู้นำทุกสิ่ง"
    FN "แถมยังเป็นข้อบังคับจนกว่าจะอายุ 24 ปีค่ะ! ส่วนที่เหลือก็ขึ้นอยู่กับความสมัครใจค่ะ! และมีเกรดที่คอยวัดระดับคะแนนความสามารถว่าจะได้เลื่อนขั้นหรือไม่ค่ะ!"
    FN "โดยมีเกรด 1, 2 และ 3 พร้อมกับ ยศ P/Private, F/Officer และ C/Commander ค่ะ!"
    GRV "ดีมาก, แต่หลานไม่ต้องอธิบายขนาดนั้นก็ได้นะ"
    FN "มันกลายเป็นเหมือนระบบกล้ามเนื้อ อัตโนมัติไปแล้วล่ะค่ะ"
    FN "..."
    FN 'หนูคิดว่า เราควรช่วยกันซ่อมบ้านตั้งแต่พรุ่งนี้เป็นต้นไปนะคะ'
    FN "แถมหนูยังได้ฝึกการซ่อมแซมจากการแข่งนั้นมาด้วย ต้องขอบคุณที่ ไวเซอร์ บังคับหนูทำค่ะ."
    GLE "แบบนั้นก็ดีเลย"
    GRV "เอาล่ะ, งั้นตาจะช่วยอีกแรง"
    GRV "ตอนนี้เป็นช่วงหยุดพักผ่อนสำหรับคนแก่ที่ไปทำงานนารวม 1 อาทิตย์พอดีเลย"
    FN "เยี่ยมไปเลยค่ะ"
    "ต่อมา, ทั้ง 3 ก็ได้ช่วยกันซ่อมแซมบ้่านที่พุพังหลังนี้"
    "จนกระทั่ง"
    GRV "เอาล่ะช่วยถือนี่ไว้แป๊บนึงนะ"
    FN "ค่ะ"
    "เจ้าหน้าที่นายทหาร" "นี่คือบ้านตระกูล นัตช์ ใช่หรือไม่?"
    GLE "ใช่แล้วค่ะ มีอะไรให้ช่วยมั้ยคะ?"









return
